In [1]:
import numpy as np
import pandas as pd

In [6]:
dict = {
    "names":['piyush','rohan','skill','chatri'],
    "marks":[99,55,66,77],
    "city":['vidisha','gwalior','mathura',"chandigarh"]
}

In [8]:
df = pd.DataFrame(dict)

In [9]:
df

    names  marks        city
0  piyush     99     vidisha
1   rohan     55     gwalior
2   skill     66     mathura
3  chatri     77  chandigarh

In [10]:
df.to_csv('friends.csv')

In [11]:
df.to_csv('friends.csv',index = False)

In [13]:
df.head(1)

    names  marks     city
0  piyush     99  vidisha

In [15]:
df.tail(1)

    names  marks        city
3  chatri     77  chandigarh

In [16]:
df.describe()

           marks
count   4.000000
mean   74.250000
std    18.786076
min    55.000000
25%    63.250000
50%    71.500000
75%    82.500000
max    99.000000

In [18]:
a = pd.read_csv('friends.csv')

In [19]:
a

    names  marks        city
0  piyush     99     vidisha
1   rohan     55     gwalior
2   skill     66     mathura
3  chatri     77  chandigarh

In [22]:
a['marks'][0]=566

C:\Users\Idea\AppData\Local\Temp\ipykernel_15260\2123064189.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a['marks'][0]=566

In [23]:
a

    names  marks        city
0  piyush    566     vidisha
1   rohan     55     gwalior
2   skill     66     mathura
3  chatri     77  chandigarh

In [28]:
a.index = ['f',1,22.3,'f']

In [29]:
a

       names  marks        city
f     piyush    566     vidisha
1      rohan     55     gwalior
22.3   skill     66     mathura
f     chatri     77  chandigarh

In [30]:
# simple array  
data = np.array([1, 3, 5, np.nan, 6, 8]) 
print(data)
s = pd.Series(data)  
print(s)

[ 1.  3.  5. nan  6.  8.]
0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64